Stats/Consolidation/KVM/mmap_1.log
file1: (g=0): rw=randrw, bs=256K-256K/256K-256K/256K-256K, ioengine=mmap, iodepth=4
file2: (g=0): rw=randrw, bs=256K-256K/256K-256K/256K-256K, ioengine=mmap, iodepth=32
file3: (g=0): rw=randrw, bs=256K-256K/256K-256K/256K-256K, ioengine=mmap, iodepth=8
file4: (g=0): rw=randrw, bs=256K-256K/256K-256K/256K-256K, ioengine=mmap, iodepth=16
fio-2.2.8
Starting 4 processes

file1: (groupid=0, jobs=1): err= 0: pid=2299: Mon Feb 22 16:20:39 2016
  read : io=270848KB, bw=1376.5KB/s, iops=5, runt=196772msec
    clat (msec): min=14, max=437, avg=88.63, stdev=73.14
     lat (msec): min=14, max=437, avg=88.64, stdev=73.14
    clat percentiles (msec):
     |  1.00th=[   15],  5.00th=[   15], 10.00th=[   15], 20.00th=[   15],
     | 30.00th=[   15], 40.00th=[   16], 50.00th=[   98], 60.00th=[  124],
     | 70.00th=[  139], 80.00th=[  155], 90.00th=[  180], 95.00th=[  198],
     | 99.00th=[  269], 99.50th=[  306], 99.90th=[  396], 99.95th=[  437],
     | 99.99th=[  437]
    bw (KB  /s): min=  366, max= 4346, per=26.29%, avg=1429.46, stdev=733.62
  write: io=253440KB, bw=1287.2KB/s, iops=5, runt=196772msec
    clat (msec): min=26, max=400, avg=103.89, stdev=72.60
     lat (msec): min=26, max=400, avg=103.90, stdev=72.61
    clat percentiles (msec):
     |  1.00th=[   28],  5.00th=[   31], 10.00th=[   34], 20.00th=[   37],
     | 30.00th=[   37], 40.00th=[   39], 50.00th=[  100], 60.00th=[  143],
     | 70.00th=[  159], 80.00th=[  169], 90.00th=[  192], 95.00th=[  215],
     | 99.00th=[  306], 99.50th=[  326], 99.90th=[  400], 99.95th=[  400],
     | 99.99th=[  400]
    bw (KB  /s): min=  285, max= 2293, per=25.50%, avg=1297.20, stdev=426.17
    lat (msec) : 20=22.56%, 50=23.24%, 100=4.44%, 250=47.95%, 500=1.81%
  cpu          : usr=0.10%, sys=9.43%, ctx=136076, majf=131072, minf=33
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=1058/w=990/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=4
file2: (groupid=0, jobs=1): err= 0: pid=2300: Mon Feb 22 16:20:39 2016
  read : io=270848KB, bw=1359.6KB/s, iops=5, runt=199227msec
    clat (msec): min=14, max=505, avg=90.30, stdev=76.39
     lat (msec): min=14, max=505, avg=90.30, stdev=76.39
    clat percentiles (msec):
     |  1.00th=[   15],  5.00th=[   15], 10.00th=[   15], 20.00th=[   15],
     | 30.00th=[   15], 40.00th=[   16], 50.00th=[   98], 60.00th=[  124],
     | 70.00th=[  139], 80.00th=[  155], 90.00th=[  182], 95.00th=[  206],
     | 99.00th=[  289], 99.50th=[  326], 99.90th=[  388], 99.95th=[  506],
     | 99.99th=[  506]
    bw (KB  /s): min=  364, max= 5089, per=26.30%, avg=1429.98, stdev=745.86
  write: io=253440KB, bw=1272.2KB/s, iops=4, runt=199227msec
    clat (msec): min=24, max=658, avg=104.59, stdev=79.13
     lat (msec): min=24, max=658, avg=104.59, stdev=79.14
    clat percentiles (msec):
     |  1.00th=[   27],  5.00th=[   28], 10.00th=[   29], 20.00th=[   34],
     | 30.00th=[   37], 40.00th=[   37], 50.00th=[   99], 60.00th=[  135],
     | 70.00th=[  159], 80.00th=[  176], 90.00th=[  200], 95.00th=[  225],
     | 99.00th=[  318], 99.50th=[  355], 99.90th=[  660], 99.95th=[  660],
     | 99.99th=[  660]
    bw (KB  /s): min=  304, max= 2456, per=25.17%, avg=1280.41, stdev=436.38
    lat (msec) : 20=22.61%, 50=23.29%, 100=5.08%, 250=46.34%, 500=2.54%
    lat (msec) : 750=0.15%
  cpu          : usr=0.12%, sys=9.33%, ctx=136111, majf=131072, minf=33
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=1058/w=990/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32
file3: (groupid=0, jobs=1): err= 0: pid=2301: Mon Feb 22 16:20:39 2016
  read : io=270848KB, bw=1361.9KB/s, iops=5, runt=198888msec
    clat (msec): min=14, max=1565, avg=89.84, stdev=86.06
     lat (msec): min=14, max=1565, avg=89.85, stdev=86.06
    clat percentiles (msec):
     |  1.00th=[   15],  5.00th=[   15], 10.00th=[   15], 20.00th=[   15],
     | 30.00th=[   15], 40.00th=[   16], 50.00th=[   98], 60.00th=[  124],
     | 70.00th=[  141], 80.00th=[  155], 90.00th=[  178], 95.00th=[  198],
     | 99.00th=[  269], 99.50th=[  306], 99.90th=[  396], 99.95th=[ 1565],
     | 99.99th=[ 1565]
    bw (KB  /s): min=  159, max= 4970, per=26.37%, avg=1433.55, stdev=741.33
  write: io=253440KB, bw=1274.3KB/s, iops=4, runt=198888msec
    clat (msec): min=26, max=692, avg=104.74, stdev=79.52
     lat (msec): min=26, max=692, avg=104.75, stdev=79.52
    clat percentiles (msec):
     |  1.00th=[   28],  5.00th=[   29], 10.00th=[   31], 20.00th=[   36],
     | 30.00th=[   37], 40.00th=[   38], 50.00th=[  100], 60.00th=[  143],
     | 70.00th=[  157], 80.00th=[  167], 90.00th=[  192], 95.00th=[  225],
     | 99.00th=[  326], 99.50th=[  441], 99.90th=[  693], 99.95th=[  693],
     | 99.99th=[  693]
    bw (KB  /s): min=  159, max= 2480, per=25.34%, avg=1289.54, stdev=440.97
    lat (msec) : 20=22.36%, 50=23.63%, 100=4.83%, 250=46.73%, 500=2.25%
    lat (msec) : 750=0.15%, 2000=0.05%
  cpu          : usr=0.10%, sys=9.32%, ctx=136043, majf=131072, minf=32
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=1058/w=990/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=8
file4: (groupid=0, jobs=1): err= 0: pid=2302: Mon Feb 22 16:20:39 2016
  read : io=270848KB, bw=1369.1KB/s, iops=5, runt=197712msec
    clat (msec): min=14, max=389, avg=90.20, stdev=73.91
     lat (msec): min=14, max=389, avg=90.20, stdev=73.91
    clat percentiles (msec):
     |  1.00th=[   15],  5.00th=[   15], 10.00th=[   15], 20.00th=[   15],
     | 30.00th=[   16], 40.00th=[   16], 50.00th=[   98], 60.00th=[  131],
     | 70.00th=[  141], 80.00th=[  157], 90.00th=[  174], 95.00th=[  198],
     | 99.00th=[  285], 99.50th=[  293], 99.90th=[  375], 99.95th=[  392],
     | 99.99th=[  392]
    bw (KB  /s): min=  365, max= 3562, per=26.49%, avg=1440.41, stdev=721.28
  write: io=253440KB, bw=1281.9KB/s, iops=5, runt=197712msec
    clat (msec): min=26, max=643, avg=103.15, stdev=75.15
     lat (msec): min=26, max=643, avg=103.16, stdev=75.16
    clat percentiles (msec):
     |  1.00th=[   28],  5.00th=[   30], 10.00th=[   33], 20.00th=[   36],
     | 30.00th=[   37], 40.00th=[   38], 50.00th=[   88], 60.00th=[  135],
     | 70.00th=[  151], 80.00th=[  167], 90.00th=[  192], 95.00th=[  225],
     | 99.00th=[  306], 99.50th=[  334], 99.90th=[  644], 99.95th=[  644],
     | 99.99th=[  644]
    bw (KB  /s): min=  344, max= 2509, per=25.51%, avg=1297.84, stdev=418.50
    lat (msec) : 20=22.22%, 50=23.63%, 100=4.98%, 250=46.68%, 500=2.44%
    lat (msec) : 750=0.05%
  cpu          : usr=0.11%, sys=9.42%, ctx=136027, majf=131072, minf=33
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=1058/w=990/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: io=1058.0MB, aggrb=5437KB/s, minb=1359KB/s, maxb=1376KB/s, mint=196772msec, maxt=199227msec
  WRITE: io=990.0MB, aggrb=5088KB/s, minb=1272KB/s, maxb=1287KB/s, mint=196772msec, maxt=199227msec

Disk stats (read/write):
    dm-1: ios=524086/12189, merge=0/0, ticks=681736/96566, in_queue=778303, util=99.98%, aggrios=524293/16158, aggrmerge=0/6, aggrticks=680913/92457, aggrin_queue=773008, aggrutil=99.97%
  sda: ios=524293/16158, merge=0/6, ticks=680913/92457, in_queue=773008, util=99.97%