Stats/Consolidation/KVM/net_14.log
receiver: (g=0): rw=read, bs=4K-4K/4K-4K/4K-4K, ioengine=net, iodepth=8
sender: (g=0): rw=write, bs=4K-4K/4K-4K/4K-4K, ioengine=net, iodepth=8
fio-2.2.8
Starting 2 processes

receiver: (groupid=0, jobs=1): err= 0: pid=2336: Mon Feb 22 16:35:36 2016
  read : io=10240MB, bw=988395Kbit/s, iops=30887, runt= 84871msec
    clat (usec): min=27, max=3121, avg=30.09, stdev= 5.00
     lat (usec): min=27, max=3122, avg=30.43, stdev= 5.03
    clat percentiles (usec):
     |  1.00th=[   28],  5.00th=[   28], 10.00th=[   28], 20.00th=[   29],
     | 30.00th=[   29], 40.00th=[   29], 50.00th=[   29], 60.00th=[   29],
     | 70.00th=[   29], 80.00th=[   30], 90.00th=[   31], 95.00th=[   38],
     | 99.00th=[   49], 99.50th=[   54], 99.90th=[   62], 99.95th=[   64],
     | 99.99th=[   87]
    bw (Kbit/s): min=   24, max=1000896, per=100.00%, avg=982653.88, stdev=75940.53
    lat (usec) : 50=99.14%, 100=0.86%, 250=0.01%, 500=0.01%, 750=0.01%
    lat (msec) : 4=0.01%
  cpu          : usr=11.09%, sys=38.57%, ctx=2621457, majf=0, minf=37
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=2621440/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=8
sender: (groupid=0, jobs=1): err= 0: pid=2337: Mon Feb 22 16:35:36 2016
  write: io=10240MB, bw=988395Kbit/s, iops=30887, runt= 84871msec
    clat (usec): min=27, max=3130, avg=30.49, stdev= 5.12
     lat (usec): min=28, max=3131, avg=30.86, stdev= 5.14
    clat percentiles (usec):
     |  1.00th=[   28],  5.00th=[   29], 10.00th=[   29], 20.00th=[   29],
     | 30.00th=[   29], 40.00th=[   29], 50.00th=[   29], 60.00th=[   30],
     | 70.00th=[   30], 80.00th=[   30], 90.00th=[   31], 95.00th=[   39],
     | 99.00th=[   50], 99.50th=[   57], 99.90th=[   63], 99.95th=[   67],
     | 99.99th=[   82]
    bw (Kbit/s): min=979136, max=1000896, per=100.00%, avg=988466.37, stdev=4461.15
    lat (usec) : 50=98.75%, 100=1.25%, 250=0.01%, 500=0.01%, 750=0.01%
    lat (msec) : 4=0.01%
  cpu          : usr=9.41%, sys=40.81%, ctx=2621451, majf=0, minf=21
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=2621440/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: io=10240MB, aggrb=988392Kbit/s, minb=988392Kbit/s, maxb=988392Kbit/s, mint=84871msec, maxt=84871msec
  WRITE: io=10240MB, aggrb=988392Kbit/s, minb=988392Kbit/s, maxb=988392Kbit/s, mint=84871msec, maxt=84871msec