Stats/Consolidation/KVM/net_2.log
receiver: (g=0): rw=read, bs=4K-4K/4K-4K/4K-4K, ioengine=net, iodepth=8
sender: (g=0): rw=write, bs=4K-4K/4K-4K/4K-4K, ioengine=net, iodepth=8
fio-2.2.8
Starting 2 processes

receiver: (groupid=0, jobs=1): err= 0: pid=2270: Mon Feb 22 16:18:07 2016
  read : io=10240MB, bw=983101Kbit/s, iops=30721, runt= 85328msec
    clat (usec): min=27, max=1915, avg=30.28, stdev= 4.86
     lat (usec): min=28, max=1916, avg=30.62, stdev= 4.90
    clat percentiles (usec):
     |  1.00th=[   28],  5.00th=[   28], 10.00th=[   29], 20.00th=[   29],
     | 30.00th=[   29], 40.00th=[   29], 50.00th=[   29], 60.00th=[   29],
     | 70.00th=[   29], 80.00th=[   30], 90.00th=[   31], 95.00th=[   38],
     | 99.00th=[   50], 99.50th=[   55], 99.90th=[   63], 99.95th=[   81],
     | 99.99th=[   93]
    bw (Kbit/s): min=   24, max=989888, per=100.00%, avg=977391.67, stdev=75221.92
    lat (usec) : 50=98.82%, 100=1.18%, 250=0.01%, 500=0.01%, 750=0.01%
    lat (usec) : 1000=0.01%
    lat (msec) : 2=0.01%
  cpu          : usr=10.89%, sys=38.86%, ctx=2621489, majf=0, minf=36
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=2621440/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=8
sender: (groupid=0, jobs=1): err= 0: pid=2271: Mon Feb 22 16:18:07 2016
  write: io=10240MB, bw=983101Kbit/s, iops=30721, runt= 85328msec
    clat (usec): min=28, max=1919, avg=30.61, stdev= 4.96
     lat (usec): min=28, max=1920, avg=30.98, stdev= 4.98
    clat percentiles (usec):
     |  1.00th=[   28],  5.00th=[   29], 10.00th=[   29], 20.00th=[   29],
     | 30.00th=[   29], 40.00th=[   29], 50.00th=[   29], 60.00th=[   30],
     | 70.00th=[   30], 80.00th=[   30], 90.00th=[   31], 95.00th=[   39],
     | 99.00th=[   51], 99.50th=[   58], 99.90th=[   67], 99.95th=[   78],
     | 99.99th=[   92]
    bw (Kbit/s): min=976128, max=989888, per=100.00%, avg=983138.26, stdev=2494.49
    lat (usec) : 50=98.44%, 100=1.55%, 250=0.01%, 500=0.01%, 750=0.01%
    lat (usec) : 1000=0.01%
    lat (msec) : 2=0.01%
  cpu          : usr=9.61%, sys=40.55%, ctx=2621472, majf=0, minf=21
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=2621440/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: io=10240MB, aggrb=983096Kbit/s, minb=983096Kbit/s, maxb=983096Kbit/s, mint=85328msec, maxt=85328msec
  WRITE: io=10240MB, aggrb=983096Kbit/s, minb=983096Kbit/s, maxb=983096Kbit/s, mint=85328msec, maxt=85328msec